Repository: 84000/data-translation-memory
Catalog: toh224-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཉོན་མོངས་པའི་དགྲ་ཐམས་ཅད་དང་བྲལ་བ་དང་། ཆོས་ཐམས་ཅད་ཀྱིས་མ་གོས་པ་ལགས་པའི་སླད་དུའོ། །
en: Because, Blessed One, this presentation is free of all enemies—the afflictions—and unstained by all phenomena.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བགྱིད་པའམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི་སྦྱངས་པའི་ཡོན་ཏན་སྨྲ་བའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: Then, the venerable Mahākāśyapa said to the Blessed One, “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among those who propound ascetic practices.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སྦྱངས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱིས་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་དུ་མི་འགྱུར་བའི་སླད་དུའོ། །
en: Because, Blessed One, this presentation of Dharma has purified all afflictions and does not have the defilement brought about by all phenomena.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བགྱིད་པའམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི་བསླབ་པ་ལ་དགའ་བའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: Then, the venerable Rāhula said to the Blessed One, “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among those who delight in the trainings.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བསླབ་པ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལགས་པའི་སླད་དུའོ། །
en: Because, Blessed One, this presentation of Dharma is the perfection of all trainings.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བགྱིད་པའམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི་འདུལ་བ་འཛིན་པའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: Then, the venerable Upāli said to the Blessed One, “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among those who uphold the vinaya.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་སེལ་བར་བགྱིད་པ་ལགས་པའི་སླད་དུའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Because, Blessed One, this presentation of Dharma causes one to eliminate all afflictions.”

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བགྱིད་པའམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི་མང་དུ་ཐོས་པའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: Then, the venerable Ānanda spoke thus to the Blessed One: “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among the erudite.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཐོས་པ་ཐམས་ཅད་དང་ལྡན་པ་ལགས་པའི་སླད་དུའོ། །
en: Because, Blessed One, this presentation of Dharma is possessed of all learning.”

source: དེ་ལྟར་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་རང་རང་གི་མཆོག་བརྗོད་པ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མངོན་པར་བསྟོད་དོ། །
en: In this way all the great śrāvakas praised this presentation of Dharma through proclamations of their own foremost quality.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་ཆོས་ཐམས་ཅད་བསལ་བ་མེད་ཅིང་གཞག་པ་མེད་པ་ལ་གནས་པས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་འདི་བདག་ཉིད་ཀྱིས་ཡང་དག་པར་སྟོན་ཅིག །
en: The Blessed One then said to the venerable Ānanda, “This being so, Ānanda, by staying in the non-negation and non-affirmation of all phenomena, teach this enlightenment of buddhahood yourself.

source: ཆོས་གང་ཡང་དོར་དུ་མེད་པ་དང་། ཐོབ་པར་བྱར་མེད་པར་ཆོས་སྟོན་ཅིག །ཡོངས་སུ་ཤེས་པར་བྱར་མེད་པ་དང་། སྤང་དུ་མེད་པ་དང་། བསྒོམ་དུ་མེད་པ་དང་། མངོན་སུམ་དུ་བྱར་མེད་པ་དང་། མངོན་པར་རྟོགས་པར་བྱར་མེད་པ་དང་། འཁོར་བ་ལས་བསྐྱོད་དུ་མེད་པ་དང་།
en: Teach the Dharma that there are no phenomena at all to be discarded and nothing to be attained.

source: མྱ་ངན་ལས་འདས་པར་འགྲོར་མེད་པ་དང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་བྱར་མེད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བར་འགྱུར་བ་དང་། ཕྱིར་མི་འོང་བར་འགྱུར་བ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཀྱི་འབྲས་བུ་ཐོབ་པར་བྱར་མེད་པར་ཆོས་སྟོན་ཅིག །
en: Teach the Dharma that there is nothing to be understood, to be abandoned, to be cultivated, to be actualized, or to be realized, no departing from saṃsāra, no going to nirvāṇa, no achieving the result of a stream enterer, of a once-returner, of a non-returner, and no achieving the result of an arhat.

source: ཀུན་དགའ་བོ་ཆོས་ཐམས་ཅད་ནི་རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པའི་ཆོས་ཡིན་ཏེ། ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །
en: Because, Ānanda, all phenomena are the phenomena of stream enterers, once-returners, non-returners, and arhats due to the sameness of the dharmadhātu.

source: ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན། ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་གང་ཟག་རྣམས་ལ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་བཟླར་མེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཐོབ་པར་བྱར་མེད་པར་ཆོས་སྟོན་ཅིག །
en: “This being so, Ānanda, to individuals of the Bodhisattva Vehicle teach the Dharma that there is no passing beyond the levels of śrāvakas and pratyekabuddhas, and no achieving of the qualities of a buddha.

source: ཀུན་དགའ་བོ་ཆོས་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཡིན་ཏེ། ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །ཀུན་དགའ་བོ།
en: Because, Ānanda, all phenomena are the phenomena of buddhas due to the sameness of the dharmadhātu.

source: གཞན་ཡང་ཁྱོད་ཀྱིས་རྣལ་འབྱོར་སྤྱོད་པའི་དགེ་སློང་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱ་བར་འདོད་པ་རྣམས་ལ་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྤང་དུ་མེད་པར་ཆོས་སྟོན་ཅིག །
en: “Moreover, Ānanda, to bhikṣus who engage in yogic practice with the wish to actualize arhatship, teach the Dharma that there is no abandoning of attachment, of hatred, or of ignorance.

source: དེ་བཞིན་གཤེགས་པ་བལྟར་མེད་པ་དང་། ཆོས་མཉན་དུ་མེད་པ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱར་མེད་པར་ཆོས་སྟོན་ཅིག །ཀུན་དགའ་བོ་འདོད་ཆགས་དང་།
en: “Teach the Dharma that the Tathāgata is not seen, that there is no Dharma to be heard, and that the Saṅgha is not to be honored.

source: ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ནི་སྤང་དུ་མེད་པ་ཁོ་ན་སྟེ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ཡ་མ་བརླ་ཡིན་པའི་ཕྱིར་རོ། །
en: “Ānanda, attachment, hatred, and ignorance are just not to be abandoned, because attachment, hatred, and ignorance are vacuous.

source: ཀུན་དགའ་བོ་སྐད་ཅིག་པ་རྣམས་ནི་སྤང་བར་བྱ་བ་མ་ཡིན་ཏེ་མེད་པའི་ཕྱིར་རོ། །
en: Ānanda, momentary things are not to be abandoned, because they do not exist.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་བལྟར་མ་མཆིས་པ་ལགས།
en: The venerable Ānanda then asked the Blessed One, “Blessed One, how is it that the Tathāgata is not seen?

source: ཇི་ལྟར་ཆོས་མཉན་དུ་མ་མཆིས་པ་ལགས།
en: How is it that there is no Dharma to be heard?

source: ཇི་ལྟར་དགེ་འདུན་བསྙེན་བཀུར་བགྱིར་མ་མཆིས་པ་ལགས།
en: How is it that the Saṅgha is not to be honored?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་ནི་བསྟན་དུ་མེད་པ་སྟེ།
en: The Blessed One replied, “Ānanda, the Tathāgata is indemonstrable.

source: དེ་ནི་མིག་གིས་བལྟ་བར་མི་ནུས་སོ། །
en: He cannot be seen with the eyes.

source: ཀུན་དགའ་བོ་ཆོས་ནི་བརྗོད་དུ་མེད་པ་སྟེ།
en: Ānanda, the Dharma is inexpressible.

source: དེ་ནི་རྣ་བས་མཉན་པར་མི་ནུས་སོ། །
en: It cannot be heard with the ears.

source: ཀུན་དགའ་བོ་དགེ་འདུན་ནི་འདུས་མ་བྱས་པ་སྟེ།
en: Ānanda, the Saṅgha is unconditioned.

source: དེ་ནི་ལུས་སམ། ངག་གམ། སེམས་ཀྱིས་བསྙེན་བཀུར་བྱར་མི་ནུས་སོ། །
en: It cannot be honored with body, speech, or mind.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་ལྟར་རྟོགས་པར་དཀའ་བ་ནི་ངོ་མཚར་ལགས་སོ། །
en: The venerable Ānanda then said to the Blessed One, “Blessed One, the true nature of the blessed buddhas that is difficult to realize in this way is astonishing.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེ་ནི་ཁྱོད་ཇི་སྐད་ཟེར་བ་དེ་བཞིན་ཏེ།
en: The Blessed One said, “Ānanda, it is as you say.

source: རྣམ་གྲངས་འདིས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་ནི་རྟོགས་པར་དཀའོ། །
en: It is difficult to realize the true nature of the blessed buddhas as presented here.

source: ཀུན་དགའ་བོ་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་ཀྱང་སེམས་ཡོངས་སུ་སྦྱང་དགོས་ལ། ཆོས་གང་ལས་ཀྱང་བསྐྱོད་པར་ཡང་མི་བྱ། འཕགས་པར་ཡང་མི་བྱ་བའི་ཕྱིར་རོ། །
en: Ānanda, one must purify the mind from all afflictions, yet also neither move away from any phenomenon, nor pass beyond any phenomenon.

source: ཀུན་དགའ་བོ་གང་རྣམ་གྲངས་འདིས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་ཅིང་མོས་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་ནི་ངོ་མཚར་དུ་གྱུར་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: “Ānanda, know that those sentient beings who enter the way of the Dharma of the tathāgatas through this presentation are astonishing.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ངའི་བསྟན་པ་འདི་ལ་རབ་ཏུ་བྱུང་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བྱེད་པའམ། མོས་པར་བྱེད་པ་དེ་དག་གིས་ནི་ཡུལ་འཁོར་གྱི་ཟས་ལེགས་པར་ཟོས་སོ། །
en: Ānanda, whichever noble sons or noble daughters who have gone forth into this teaching of mine uphold this presentation of Dharma, master it, or have faith in it have properly eaten the foods of the land.

source: དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ལེགས་པར་རབ་ཏུ་བྱུང་ངོ་། །
en: They have gone forth well into the teachings of the Tathāgata.

source: དེ་དག་གིས་ནི་མིའི་ལུས་ཐོབ་པ་ལེགས་པར་ཐོབ་བོ། །
en: The human body they have attained has been attained well.

source: དེ་དག་གིས་ནི་བདུད་སྡིག་ཅན་བཏུལ་ལོ། །
en: They have subjugated the evil Māra.

source: དེ་དག་གིས་ནི་ངའོ་སྙམ་པའི་ང་རྒྱལ་ངེས་པར་བཅོམ་མོ། །
en: They have definitively overcome the conceit of thinking of themselves.

source: དེ་དག་གིས་ནི་སྦྱིན་གནས་སྦྱངས་སོ། །
en: They have trained in regarding it as worthy of offerings.

source: དེ་དག་གིས་ནི་ཡོན་གནས་སུ་གཟུང་བར་བྱའོ། །
en: They should uphold it as worthy of honor.

source: དེ་དག་གིས་ནི་བསོད་ནམས་ཀྱི་ཞིང་དུ་བལྟ་བར་བྱའོ། །
en: They should view it as a field of merit.

source: ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་མངོན་པའི་ང་རྒྱལ་ཅན་རྣམས་དང་། འབྲས་བུ་ལ་དམིགས་པ་རྣམས་དང་། བྱང་ཆུབ་ལ་དམིགས་པ་རྣམས་དང་། སྔོན་གྱི་རྒྱལ་བ་རྣམས་ལ་བྱ་བ་མ་བྱས་པ་རྣམས་ཀྱིས་བཟོད་པར་མི་ནུས་པའི་ཕྱིར་རོ། །
en: Because, Ānanda, those with manifest pride, those who apprehend a result, those who apprehend enlightenment, and those who have not served the past victors cannot accept this presentation of Dharma.”

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བསྟན་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་བརྟན་པས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: When this presentation of Dharma was taught, the bodhisattva Dṛḍhādhyāśaya achieved the acceptance that phenomena are nonarising.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །
en: The Blessed One then smiled.

source: འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་དེ། གང་གི་ཚེ་འཛུམ་པ་མཛད་པ་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་འོད་ཟེར་ཁ་དོག་དུ་མ་ཁ་དོག་སྣ་ཚོགས་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་།
en: As is the nature of the buddha bhagavāns, at that time myriad light rays of many colors issued forth from the Blessed One’s mouth—namely, blue, yellow, red, white, crimson, crystal, and silver.

source: དཀར་པོ་དང་། བཙོད་ཀ་དང་ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་དག་བྱུང་ནས། འོད་ཟེར་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པ་སྣང་བས་ཁྱབ་པར་བྱས་ཏེ།
en: They pervaded boundless, limitless world systems with light.

source: ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དག་ཏུ་སོང་ནས་ཕྱིར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱི་གཙུག་ཏུ་ནུབ་པར་གྱུར་ཏོ། །
en: Having reached all the way up to the world of Brahmā they returned and circled the Blessed One three times then disappeared into the crown of the Blessed One’s head.

source: དེ་ནས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Then, through the blessings of the Buddha, the venerable Ānanda stood up from his seat, and, draping his upper robe over one shoulder, knelt with his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམས་ནི་རྒྱུ་མ་མཆིས་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན།
en: With palms joined, he bowed toward the Blessed One and said, “Blessed One, it is not without cause or condition that the tathāgatas smile.

source: བཅོམ་ལྡན་འདས་འཛུམ་པ་མཛད་པའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས་དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: What is the cause and what is the condition for your smile?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་འཁོར་འདིའི་ནང་ནས་དགེ་སློང་མངོན་པའི་ང་རྒྱལ་ཅན་དུ་གྱུར་པ་ཉིས་བརྒྱ་པོ་དེ་དག་གིས་མངོན་པའི་ང་རྒྱལ་མེད་པའི་ཆོས་འདི་ཐོས་ནས་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: The Blessed One replied to the venerable Ānanda, “Ānanda, two hundred arrogant bhikṣus in the saṅgha heard this teaching on the absence of arrogance, and their minds were liberated from the defilements, without further appropriation.

source: བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་བརྟན་པས་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །
en: The bodhisattva Dṛḍhādhyāśaya achieved acceptance of unborn phenomena.

source: ཀུན་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་བརྟན་པ་འདི་ནི་བསྐལ་པ་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Ānanda, the bodhisattva Dṛḍhādhyāśaya will manifestly awaken to unsurpassed, perfectly complete enlightenment after ten thousand eons.

source: བསྐལ་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀུན་དུ་སྣང་བ་ལ། འཇིག་རྟེན་གྱི་ཁམས་མེ་ཏོག་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བཀྲ་བ་ཞེས་བྱ་བར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་པད་མ་དཔལ་གྱི་སྙིང་པོ་ཅན་ཞེས་བྱ་བར་འགྱུར་རོ། །
en: In the eon known as Illumination of All Jewels, and in the world system known as Adorned with All Flowers, he will become a tathāgata, arhat, perfectly complete buddha known as Possessing the Heart of the Glorious Jewel Lotus.

source: དེའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོན་ཏན་བཀོད་པ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པར་འགྱུར་ཏེ།
en: His buddha field will possess an unfathomable array of good qualities.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་གིས་ཡོངས་སུ་གང་བར་འགྱུར་རོ། །
en: Moreover, that buddha field will be filled entirely with bodhisattvas.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: The venerable Ānanda then asked the Blessed One, “Blessed One, what is the name of this presentation of Dharma?

source: འདི་ཇི་ལྟར་གཟུང་བར་བགྱི།
en: How should we remember it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེའི་ཕྱིར་ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི། ཆོས་ཐམས་ཅད་གཡོ་བ་མེད་པ་ཞེས་བྱ་བར་ཟུང་ཤིག །ལྷག་པའི་བསམ་པ་བརྟན་པའི་ལེའུ་ཞེས་བྱ་བར་ཡང་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: The Blessed One replied, “Ānanda, you should thus remember this presentation of Dharma as All Phenomena Not Moving Away.

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷག་པའི་བསམ་པ་བརྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། དགེ་སློང་དེ་དག་དང་།
en: You should also remember it as The Episode of Dṛḍhādhyāśaya.”

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: After the Blessed One had spoken these words, the venerable Ānanda, the bodhisattva Dṛḍhādhyāśaya, the bodhisattvas, and the bhikṣus, along with everyone else in attendance and the world with its gods, humans, asuras, and gandharvas, rejoiced in what the Blessed One had said.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།འཕགས་པ་ལྷག་པའི་བསམ་པ་བརྟན་པའི་ལེའུ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This completes the noble Mahāyāna sūtra “The Episode of Dṛḍhādhyāśaya.”

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེན་དྲ་བོ་དྷི་དང་། པྲ་ཛྙཱ་བར་མ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: Translated, edited, and finalized by the Indian preceptors Surendrabodhi and Prajñāvarman, the chief Tibetan editor and translator Bandé Yeshé Dé, and others.
